SpenceKonde/DxCore/megaavr/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification


menu.chip=Chip
menu.clock=Clock Speed
menu.millis=millis()/micros() timer (TCB2 recommended)
menu.serialevent=Support SerialEvent?
menu.bodvoltage=BOD level if enabled (Bootload burn req'd)
menu.bodmode=BOD Mode Active/Sleeping (Bootload burn req'd)
menu.eesave=Save EEPROM (Bootload burn req'd)
menu.resetpin=Reset pin function (Bootload burn req'd)
menu.startuptime=Startup Time (Bootload burn req'd)
menu.bootloaderusart=Bootloader Serial Port (Bootload burn req'd)
menu.timeout=Bootloader Timeout (Bootload burn req'd)
menu.appspm=Flash Writing

##############################################################

# BOARD NAMES

avrda.name=AVR DA-series (no bootloader)
avrdb.name=AVR DB-series (no bootloader)
#avrdd.name=AVR DD-series (no bootloader)
avrdaopti.name=AVR DA-series (Optiboot)
avrdbopti.name=AVR DB-series (Optiboot)
#avrddopti.name=AVR DD-series (Optiboot)


##############################################################

#########################################
#
#    AVR DA-series
#
#########################################

################################
# Constant across all settings #
################################

avrda.upload.tool=avrdude

# Build settings
avrda.build.board=avrda
avrda.build.core=dxcore
avrda.build.text_section_start=.text=0x0
avrda.build.extra_flags={build.millis} -DCLOCK_SOURCE={build.clocksource} {bootloader.appspm}
avrda.build.export_merged_output=false
avrda.build.mcupostfix=

# Bootloading settings
avrda.bootloader.tool=avrdude
avrda.bootloader.WDTCFG=0x00
avrda.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda.bootloader.CODESIZE=0x00
avrda.bootloader.BOOTSIZE=0x01
avrda.bootloader.avrdudestring=
avrda.bootloader.pymcuprogstring=-aerase

################################
# Tools Submenu Options        #
################################

# App SPM
avrda.menu.appspm.no=Disabled
avrda.menu.appspm.no.bootloader.appspm=
avrda.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrda.menu.appspm.16plus=Above 16k
avrda.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrda.menu.appspm.16plus.bootloader.CODESIZE=32
avrda.menu.appspm.24plus=Above 24k
avrda.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrda.menu.appspm.24plus.bootloader.CODESIZE=48
avrda.menu.appspm.32plus=Above 32k (AVR128/64 only)
avrda.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrda.menu.appspm.32plus.bootloader.CODESIZE=64
avrda.menu.appspm.48plus=Above 48k (AVR128/64 only)
avrda.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrda.menu.appspm.48plus.bootloader.CODESIZE=96
avrda.menu.appspm.56plus=Above 56k (AVR128/64 only)
avrda.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrda.menu.appspm.56plus.bootloader.CODESIZE=112
avrda.menu.appspm.64plus=Above 64k (AVR128 only)
avrda.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
avrda.menu.appspm.64plus.bootloader.CODESIZE=128
avrda.menu.appspm.96plus=Above 96k (AVR128 only)
avrda.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
avrda.menu.appspm.96plus.bootloader.CODESIZE=192
avrda.menu.appspm.112plus=Above 112k (AVR128 only)
avrda.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
avrda.menu.appspm.112plus.bootloader.CODESIZE=224
avrda.menu.appspm.full=Anywhere
avrda.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1


# Chip (pins and memory size)
avrda.menu.chip.128DA28=AVR128DA28
avrda.menu.chip.128DA28.build.mcu=avr128da28
avrda.menu.chip.128DA28.upload.maximum_size=131072
avrda.menu.chip.128DA28.upload.maximum_data_size=16384
avrda.menu.chip.128DA28.build.variant=28pin-standard
avrda.menu.chip.128DA32=AVR128DA32
avrda.menu.chip.128DA32.build.mcu=avr128da32
avrda.menu.chip.128DA32.upload.maximum_size=131072
avrda.menu.chip.128DA32.upload.maximum_data_size=16384
avrda.menu.chip.128DA32.build.variant=32pin-standard
avrda.menu.chip.128DA48=AVR128DA48
avrda.menu.chip.128DA48.build.mcu=avr128da48
avrda.menu.chip.128DA48.upload.maximum_size=131072
avrda.menu.chip.128DA48.upload.maximum_data_size=16384
avrda.menu.chip.128DA48.build.variant=48pin-standard
avrda.menu.chip.128DA64=AVR128DA64
avrda.menu.chip.128DA64.build.mcu=avr128da64
avrda.menu.chip.128DA64.upload.maximum_size=131072
avrda.menu.chip.128DA64.upload.maximum_data_size=16384
avrda.menu.chip.128DA64.build.variant=64pin-standard
avrda.menu.chip.64DA28=AVR64DA28
avrda.menu.chip.64DA28.build.mcu=avr64da28
avrda.menu.chip.64DA28.upload.maximum_size=65536
avrda.menu.chip.64DA28.upload.maximum_data_size=8192
avrda.menu.chip.64DA28.build.variant=28pin-standard
avrda.menu.chip.64DA32=AVR64DA32
avrda.menu.chip.64DA32.build.mcu=avr64da32
avrda.menu.chip.64DA32.upload.maximum_size=65536
avrda.menu.chip.64DA32.upload.maximum_data_size=8192
avrda.menu.chip.64DA32.build.variant=32pin-standard
avrda.menu.chip.64DA48=AVR64DA48
avrda.menu.chip.64DA48.build.mcu=avr64da48
avrda.menu.chip.64DA48.upload.maximum_size=65536
avrda.menu.chip.64DA48.upload.maximum_data_size=8192
avrda.menu.chip.64DA48.build.variant=48pin-standard
avrda.menu.chip.64DA64=AVR64DA64
avrda.menu.chip.64DA64.build.mcu=avr64da64
avrda.menu.chip.64DA64.upload.maximum_size=65536
avrda.menu.chip.64DA64.upload.maximum_data_size=8192
avrda.menu.chip.64DA64.build.variant=64pin-standard
avrda.menu.chip.32DA28=AVR32DA28
avrda.menu.chip.32DA28.build.mcu=avr32da28
avrda.menu.chip.32DA28.upload.maximum_size=32768
avrda.menu.chip.32DA28.upload.maximum_data_size=4096
avrda.menu.chip.32DA28.build.variant=28pin-standard
avrda.menu.chip.32DA32=AVR32DA32
avrda.menu.chip.32DA32.build.mcu=avr32da32
avrda.menu.chip.32DA32.upload.maximum_size=32768
avrda.menu.chip.32DA32.upload.maximum_data_size=4096
avrda.menu.chip.32DA32.build.variant=32pin-standard
avrda.menu.chip.32DA48=AVR32DA48
avrda.menu.chip.32DA48.build.mcu=avr32da48
avrda.menu.chip.32DA48.upload.maximum_size=32768
avrda.menu.chip.32DA48.upload.maximum_data_size=4096
avrda.menu.chip.32DA48.build.variant=48pin-standard

# Clock Speed + Source
avrda.menu.clock.24internal=24 MHz internal
avrda.menu.clock.24internal.build.f_cpu=24000000L
avrda.menu.clock.24internal.build.speed=24
avrda.menu.clock.24internal.build.clocksource=0
avrda.menu.clock.20internal=20 MHz internal
avrda.menu.clock.20internal.build.f_cpu=20000000L
avrda.menu.clock.20internal.build.speed=20
avrda.menu.clock.20internal.build.clocksource=0
avrda.menu.clock.16internal=16 MHz internal
avrda.menu.clock.16internal.build.f_cpu=16000000L
avrda.menu.clock.16internal.build.speed=16
avrda.menu.clock.16internal.build.clocksource=0
avrda.menu.clock.12internal=12 MHz internal
avrda.menu.clock.12internal.build.f_cpu=12000000L
avrda.menu.clock.12internal.build.speed=12
avrda.menu.clock.12internal.build.clocksource=0
avrda.menu.clock.10internal=10 MHz internal
avrda.menu.clock.10internal.build.f_cpu=10000000L
avrda.menu.clock.10internal.build.speed=10
avrda.menu.clock.10internal.build.clocksource=0
avrda.menu.clock.8internal=8 MHz internal
avrda.menu.clock.8internal.build.f_cpu=8000000L
avrda.menu.clock.8internal.build.speed=8
avrda.menu.clock.8internal.build.clocksource=0
avrda.menu.clock.4internal=4 MHz internal
avrda.menu.clock.4internal.build.f_cpu=4000000L
avrda.menu.clock.4internal.build.speed=4
avrda.menu.clock.4internal.build.clocksource=0
avrda.menu.clock.1internal=1 MHz internal
avrda.menu.clock.1internal.build.f_cpu=1000000L
avrda.menu.clock.1internal.build.speed=1
avrda.menu.clock.1internal.build.clocksource=0
avrda.menu.clock.24extclock=24 MHz ext. clock
avrda.menu.clock.24extclock.build.f_cpu=24000000L
avrda.menu.clock.24extclock.build.speed=24
avrda.menu.clock.24extclock.build.clocksource=2
avrda.menu.clock.20extclock=20 MHz ext. clock
avrda.menu.clock.20extclock.build.f_cpu=20000000L
avrda.menu.clock.20extclock.build.speed=20
avrda.menu.clock.20extclock.build.clocksource=2
avrda.menu.clock.16extclock=16 MHz ext. clock
avrda.menu.clock.16extclock.build.f_cpu=16000000L
avrda.menu.clock.16extclock.build.speed=16
avrda.menu.clock.16extclock.build.clocksource=2
avrda.menu.clock.12extclock=12 MHz ext. clock
avrda.menu.clock.12extclock.build.f_cpu=12000000L
avrda.menu.clock.12extclock.build.speed=12
avrda.menu.clock.12extclock.build.clocksource=2
avrda.menu.clock.8extclock=8 MHz ext. clock
avrda.menu.clock.8extclock.build.f_cpu=8000000L
avrda.menu.clock.8extclock.build.speed=8
avrda.menu.clock.8extclock.build.clocksource=2
avrda.menu.clock.28internal=28 MHz internal (overclocked)
avrda.menu.clock.28internal.build.f_cpu=28000000L
avrda.menu.clock.28internal.build.speed=28
avrda.menu.clock.28internal.build.clocksource=0
avrda.menu.clock.32internal=32 MHz internal (overclocked)
avrda.menu.clock.32internal.build.f_cpu=32000000L
avrda.menu.clock.32internal.build.speed=32
avrda.menu.clock.32internal.build.clocksource=0
avrda.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda.menu.clock.28extclock.build.f_cpu=28000000L
avrda.menu.clock.28extclock.build.speed=28
avrda.menu.clock.28extclock.build.clocksource=2
avrda.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda.menu.clock.32extclock.build.f_cpu=32000000L
avrda.menu.clock.32extclock.build.speed=32
avrda.menu.clock.32extclock.build.clocksource=2
avrda.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda.menu.clock.36extclock.build.f_cpu=36000000L
avrda.menu.clock.36extclock.build.speed=36
avrda.menu.clock.36extclock.build.clocksource=2
avrda.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda.menu.clock.40extclock.build.f_cpu=40000000L
avrda.menu.clock.40extclock.build.speed=40
avrda.menu.clock.40extclock.build.clocksource=2
avrda.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda.menu.clock.48extclock.build.f_cpu=48000000L
avrda.menu.clock.48extclock.build.speed=48
avrda.menu.clock.48extclock.build.clocksource=2

