SpenceKonde/DxCore/megaavr/boards.txt
# Enable SerialEvent, even though it's bad
avrda.menu.serialevent.no=No
avrda.menu.serialevent.yes=Yes
avrda.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
avrda.menu.serialevent.yes.build.serialevent=

# BrownOut Detect Options
avrda.menu.bodvoltage.1v9=1.9V
avrda.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda.menu.bodvoltage.2v45=2.45V
avrda.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda.menu.bodvoltage.2v70=2.70V
avrda.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda.menu.bodvoltage.2v85=2.85V
avrda.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda.menu.bodmode.disabled=Disabled/Disabled
avrda.menu.bodmode.enabled=Enabled/Enabled
avrda.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
avrda.menu.bodmode.ensampslo=Enabled/Sampled (125Hz)
avrda.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
avrda.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
avrda.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
avrda.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
avrda.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrda.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrda.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrda.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrda.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrda.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrda.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrda.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrda.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrda.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

# EESAVE option
avrda.menu.eesave.enable=EEPROM retained
avrda.menu.eesave.enable.bootloader.eesavebit=1
avrda.menu.eesave.disable=EEPROM not retained
avrda.menu.eesave.disable.bootloader.eesavebit=0

# Reset pin as GPIO option
avrda.menu.resetpin.reset=Hardware Reset (recommended)
avrda.menu.resetpin.reset.bootloader.resetpinbits=10
avrda.menu.resetpin.input=Input (no output, ever)
avrda.menu.resetpin.input.bootloader.resetpinbits=00

# millis/micros timing source
# TCD0 and RTC not yet supported
avrda.menu.millis.tcb2=TCB2
avrda.menu.millis.tcb0=TCB0
avrda.menu.millis.tcb1=TCB1
avrda.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrda.menu.millis.tcb4=TCB4 (64-pin parts only)
avrda.menu.millis.tca0=TCA0
avrda.menu.millis.tca1=TCA1 (48/64-pin parts only)
#avrda.menu.millis.tcd0=TCD0
#avrda.menu.millis.rtc=RTC (no micros)
#avrda.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
#avrda.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrda.menu.millis.disabled=Disabled
avrda.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrda.menu.millis.tcb0.build.millistimer=B0
avrda.menu.millis.tcb1.build.millistimer=B1
avrda.menu.millis.tcb2.build.millistimer=B2
avrda.menu.millis.tcb3.build.millistimer=B3
avrda.menu.millis.tcb4.build.millistimer=B4
avrda.menu.millis.tca0.build.millistimer=A0
avrda.menu.millis.tca1.build.millistimer=A1
#avrda.menu.millis.tcd0.build.millistimer=D0
#avrda.menu.millis.rtc.build.millistimer=RTC
#avrda.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrda.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrda.menu.millis.disabled.build.millistimer=NONE

# Startup Time
avrda.menu.startuptime.8= 8ms
avrda.menu.startuptime.1= 0ms
avrda.menu.startuptime.1= 1ms
avrda.menu.startuptime.2= 2ms
avrda.menu.startuptime.4= 4ms
avrda.menu.startuptime.16= 16ms
avrda.menu.startuptime.32= 32ms
avrda.menu.startuptime.64= 64ms
avrda.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrda.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrda.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrda.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrda.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrda.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrda.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrda.menu.startuptime.64.bootloader.SYSCFG1=0x07

#########################################
#
#    AVR DB-series
#
#########################################

################################
# Constant across all settings #
################################

avrdb.upload.tool=avrdude

# Build settings
avrdb.build.board=avrdb
avrdb.build.core=dxcore
avrdb.build.text_section_start=.text=0x0
avrdb.build.extra_flags={build.millis} -DCLOCK_SOURCE={build.clocksource} {bootloader.appspm}
avrdb.build.export_merged_output=false
avrdb.build.mcupostfix=

# Bootloading settings
avrdb.bootloader.tool=avrdude
avrdb.bootloader.WDTCFG=0x00
avrdb.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
#avrdb.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdb.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
avrdb.bootloader.CODESIZE=0x00
avrdb.bootloader.BOOTSIZE=0x01
avrdb.bootloader.avrdudestring=
avrdb.bootloader.pymcuprogstring=-aerase

################################
# Tools Submenu Options        #
################################

# App SPM
avrdb.menu.appspm.no=Disabled
avrdb.menu.appspm.no.bootloader.appspm=
avrdb.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrdb.menu.appspm.16plus=Above 16k
avrdb.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrdb.menu.appspm.16plus.bootloader.CODESIZE=32
avrdb.menu.appspm.24plus=Above 24k
avrdb.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrdb.menu.appspm.24plus.bootloader.CODESIZE=48
avrdb.menu.appspm.32plus=Above 32k (AVR128/64 only)
avrdb.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrdb.menu.appspm.32plus.bootloader.CODESIZE=64
avrdb.menu.appspm.48plus=Above 48k (AVR128/64 only)
avrdb.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrdb.menu.appspm.48plus.bootloader.CODESIZE=96
avrdb.menu.appspm.56plus=Above 56k (AVR128/64 only)
avrdb.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrdb.menu.appspm.56plus.bootloader.CODESIZE=112
avrdb.menu.appspm.64plus=Above 64k (AVR128 only)
avrdb.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
avrdb.menu.appspm.64plus.bootloader.CODESIZE=128
avrdb.menu.appspm.96plus=Above 96k (AVR128 only)
avrdb.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
avrdb.menu.appspm.96plus.bootloader.CODESIZE=192
avrdb.menu.appspm.112plus=Above 112k (AVR128 only)
avrdb.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
avrdb.menu.appspm.112plus.bootloader.CODESIZE=224
avrdb.menu.appspm.full=Anywhere
avrdb.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1


# Chip (pins and memory size)
avrdb.menu.chip.128DB28=AVR128DB28
avrdb.menu.chip.128DB28.build.mcu=avr128db28
avrdb.menu.chip.128DB28.upload.maximum_size=131072
avrdb.menu.chip.128DB28.upload.maximum_data_size=16384
avrdb.menu.chip.128DB28.build.variant=28pin-standard
avrdb.menu.chip.128DB32=AVR128DB32
avrdb.menu.chip.128DB32.build.mcu=avr128db32
avrdb.menu.chip.128DB32.upload.maximum_size=131072
avrdb.menu.chip.128DB32.upload.maximum_data_size=16384
avrdb.menu.chip.128DB32.build.variant=32pin-standard
avrdb.menu.chip.128DB48=AVR128DB48
avrdb.menu.chip.128DB48.build.mcu=avr128db48
avrdb.menu.chip.128DB48.upload.maximum_size=131072
avrdb.menu.chip.128DB48.upload.maximum_data_size=16384
avrdb.menu.chip.128DB48.build.variant=48pin-standard
avrdb.menu.chip.128DB64=AVR128DB64
avrdb.menu.chip.128DB64.build.mcu=avr128db64
avrdb.menu.chip.128DB64.upload.maximum_size=131072
avrdb.menu.chip.128DB64.upload.maximum_data_size=16384
avrdb.menu.chip.128DB64.build.variant=64pin-standard
avrdb.menu.chip.64DB28=AVR64DB28
avrdb.menu.chip.64DB28.build.mcu=avr64db28
avrdb.menu.chip.64DB28.upload.maximum_size=65536
avrdb.menu.chip.64DB28.upload.maximum_data_size=8192
avrdb.menu.chip.64DB28.build.variant=28pin-standard
avrdb.menu.chip.64DB32=AVR64DB32
avrdb.menu.chip.64DB32.build.mcu=avr64db32
avrdb.menu.chip.64DB32.upload.maximum_size=65536
avrdb.menu.chip.64DB32.upload.maximum_data_size=8192
avrdb.menu.chip.64DB32.build.variant=32pin-standard
avrdb.menu.chip.64DB48=AVR64DB48
avrdb.menu.chip.64DB48.build.mcu=avr64db48
avrdb.menu.chip.64DB48.upload.maximum_size=65536
avrdb.menu.chip.64DB48.upload.maximum_data_size=8192
avrdb.menu.chip.64DB48.build.variant=48pin-standard
avrdb.menu.chip.64DB64=AVR64DB64
avrdb.menu.chip.64DB64.build.mcu=avr64db64
avrdb.menu.chip.64DB64.upload.maximum_size=65536
avrdb.menu.chip.64DB64.upload.maximum_data_size=8192
avrdb.menu.chip.64DB64.build.variant=64pin-standard
avrdb.menu.chip.32DB28=AVR32DB28
avrdb.menu.chip.32DB28.build.mcu=avr32db28
avrdb.menu.chip.32DB28.upload.maximum_size=32768
avrdb.menu.chip.32DB28.upload.maximum_data_size=4096
avrdb.menu.chip.32DB28.build.variant=28pin-standard
avrdb.menu.chip.32DB32=AVR32DB32
avrdb.menu.chip.32DB32.build.mcu=avr32db32
avrdb.menu.chip.32DB32.upload.maximum_size=32768
avrdb.menu.chip.32DB32.upload.maximum_data_size=4096
avrdb.menu.chip.32DB32.build.variant=32pin-standard
avrdb.menu.chip.32DB48=AVR32DB48
avrdb.menu.chip.32DB48.build.mcu=avr32db48
avrdb.menu.chip.32DB48.upload.maximum_size=32768
avrdb.menu.chip.32DB48.upload.maximum_data_size=4096
avrdb.menu.chip.32DB48.build.variant=48pin-standard

# Clock Speed + Source
avrdb.menu.clock.24internal=24 MHz internal
avrdb.menu.clock.24internal.build.f_cpu=24000000L
avrdb.menu.clock.24internal.build.speed=24
avrdb.menu.clock.24internal.build.clocksource=0
avrdb.menu.clock.20internal=20 MHz internal
avrdb.menu.clock.20internal.build.f_cpu=20000000L
avrdb.menu.clock.20internal.build.speed=20
avrdb.menu.clock.20internal.build.clocksource=0
avrdb.menu.clock.16internal=16 MHz internal
avrdb.menu.clock.16internal.build.f_cpu=16000000L
avrdb.menu.clock.16internal.build.speed=16
avrdb.menu.clock.16internal.build.clocksource=0
avrdb.menu.clock.12internal=12 MHz internal
avrdb.menu.clock.12internal.build.f_cpu=12000000L
avrdb.menu.clock.12internal.build.speed=12
avrdb.menu.clock.12internal.build.clocksource=0
avrdb.menu.clock.10internal=10 MHz internal
avrdb.menu.clock.10internal.build.f_cpu=10000000L
avrdb.menu.clock.10internal.build.speed=10
avrdb.menu.clock.10internal.build.clocksource=0
avrdb.menu.clock.8internal=8 MHz internal
avrdb.menu.clock.8internal.build.f_cpu=8000000L
avrdb.menu.clock.8internal.build.speed=8
avrdb.menu.clock.8internal.build.clocksource=0
avrdb.menu.clock.4internal=4 MHz internal
avrdb.menu.clock.4internal.build.f_cpu=4000000L
avrdb.menu.clock.4internal.build.speed=4
avrdb.menu.clock.4internal.build.clocksource=0
avrdb.menu.clock.1internal=1 MHz internal
avrdb.menu.clock.1internal.build.f_cpu=1000000L
avrdb.menu.clock.1internal.build.speed=1
avrdb.menu.clock.1internal.build.clocksource=0
avrdb.menu.clock.24crystal=24 MHz crystal
avrdb.menu.clock.24crystal.build.f_cpu=24000000L
avrdb.menu.clock.24crystal.build.speed=24
avrdb.menu.clock.24crystal.build.clocksource=1
avrdb.menu.clock.20crystal=20 MHz crystal
avrdb.menu.clock.20crystal.build.f_cpu=20000000L
avrdb.menu.clock.20crystal.build.speed=20
avrdb.menu.clock.20crystal.build.clocksource=1
avrdb.menu.clock.16crystal=16 MHz crystal
avrdb.menu.clock.16crystal.build.f_cpu=16000000L
avrdb.menu.clock.16crystal.build.speed=16
avrdb.menu.clock.16crystal.build.clocksource=1
avrdb.menu.clock.12crystal=12 MHz crystal
avrdb.menu.clock.12crystal.build.f_cpu=12000000L
avrdb.menu.clock.12crystal.build.speed=12
avrdb.menu.clock.12crystal.build.clocksource=1
avrdb.menu.clock.8crystal=8 MHz crystal
avrdb.menu.clock.8crystal.build.f_cpu=8000000L
avrdb.menu.clock.8crystal.build.speed=8
avrdb.menu.clock.8crystal.build.clocksource=1
avrdb.menu.clock.24extclock=24 MHz ext. clock
avrdb.menu.clock.24extclock.build.f_cpu=24000000L
avrdb.menu.clock.24extclock.build.speed=24
avrdb.menu.clock.24extclock.build.clocksource=2
avrdb.menu.clock.20extclock=20 MHz ext. clock
avrdb.menu.clock.20extclock.build.f_cpu=20000000L
avrdb.menu.clock.20extclock.build.speed=20
avrdb.menu.clock.20extclock.build.clocksource=2
avrdb.menu.clock.16extclock=16 MHz ext. clock
avrdb.menu.clock.16extclock.build.f_cpu=16000000L
avrdb.menu.clock.16extclock.build.speed=16
avrdb.menu.clock.16extclock.build.clocksource=2
avrdb.menu.clock.12extclock=12 MHz ext. clock
avrdb.menu.clock.12extclock.build.f_cpu=12000000L
avrdb.menu.clock.12extclock.build.speed=12
avrdb.menu.clock.12extclock.build.clocksource=2
avrdb.menu.clock.8extclock=8 MHz ext. clock
avrdb.menu.clock.8extclock.build.f_cpu=8000000L
avrdb.menu.clock.8extclock.build.speed=8
avrdb.menu.clock.8extclock.build.clocksource=2
avrdb.menu.clock.28internal=28 MHz internal (overclocked)
avrdb.menu.clock.28internal.build.f_cpu=28000000L
avrdb.menu.clock.28internal.build.speed=28
avrdb.menu.clock.28internal.build.clocksource=0
avrdb.menu.clock.32internal=32 MHz internal (overclocked)
avrdb.menu.clock.32internal.build.f_cpu=32000000L
avrdb.menu.clock.32internal.build.speed=32
avrdb.menu.clock.32internal.build.clocksource=0
avrdb.menu.clock.28crystal=28 MHz crystal (overclocked)
avrdb.menu.clock.28crystal.build.f_cpu=28000000L
avrdb.menu.clock.28crystal.build.speed=28
avrdb.menu.clock.28crystal.build.clocksource=1
avrdb.menu.clock.32crystal=32 MHz crystal (overclocked)
avrdb.menu.clock.32crystal.build.f_cpu=32000000L
avrdb.menu.clock.32crystal.build.speed=32
avrdb.menu.clock.32crystal.build.clocksource=1
avrdb.menu.clock.36crystal=36 MHz crystal (overclocked)
avrdb.menu.clock.36crystal.build.f_cpu=36000000L
avrdb.menu.clock.36crystal.build.speed=36
avrdb.menu.clock.36crystal.build.clocksource=1
avrdb.menu.clock.40crystal=40 MHz crystal (overclocked)
avrdb.menu.clock.40crystal.build.f_cpu=40000000L
avrdb.menu.clock.40crystal.build.speed=40
avrdb.menu.clock.40crystal.build.clocksource=1
avrdb.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdb.menu.clock.28extclock.build.f_cpu=28000000L
avrdb.menu.clock.28extclock.build.speed=28
avrdb.menu.clock.28extclock.build.clocksource=2
avrdb.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdb.menu.clock.32extclock.build.f_cpu=32000000L
avrdb.menu.clock.32extclock.build.speed=32
avrdb.menu.clock.32extclock.build.clocksource=2
avrdb.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdb.menu.clock.36extclock.build.f_cpu=36000000L
avrdb.menu.clock.36extclock.build.speed=36
avrdb.menu.clock.36extclock.build.clocksource=2
avrdb.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdb.menu.clock.40extclock.build.f_cpu=40000000L
avrdb.menu.clock.40extclock.build.speed=40
avrdb.menu.clock.40extclock.build.clocksource=2
avrdb.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdb.menu.clock.48extclock.build.f_cpu=48000000L
avrdb.menu.clock.48extclock.build.speed=48
avrdb.menu.clock.48extclock.build.clocksource=2

